这时可以用 zm, zr 这两个指令来增加或减少折叠的层数。

一：打开多个文件：
		一、vim还没有启动的时候：
		1.在终端里输入 
		vim file1 file2 ... filen便可以打开所有想要打开的文件
		2.vim已经启动
		输入
		:e file
		可以再打开一个文件，并且此时vim里会显示出file文件的内容。
		3.同时显示多个文件：
		:sp         //水平切分窗口
		:vsplit     //垂直切分窗口
		:sp 文档名  在新窗口中打开文档
		二、在文件之间切换：
		1.文件间切换
		Ctrl+6  //两文件间的切换
		:bn      //下一个文件
		:bp      //上一个文件
		:ls       //列出打开的文件，带编号
		:b1~n  //切换至第n个文件

		对于用(v)split在多个窗格中打开的文件，这种方法只会在当前窗格中切换不同的文件。
		2.在窗格间切换的方法
		Ctrl+w+方向键——切换到前／下／上／后一个窗格
		Ctrl+w+h/j/k/l ——同上
		Ctrl+ww——依次向后切换到下一个窗格中
		两次Ctrl + w可以切换窗口


二：搜索关键词 shift + * 搜索一个关键字的时候

三：文件定位
	使用vim 打开文件时，默认情况下光标会停留在文件开头，有时候文件比较大，翻阅和查找都比较麻烦，怎样在打开的时候直接定位到某一行呢？ 
	    使用 "+" 
	    vim filename +n 可以在打开文件的同时定位到第n行。
	eg:  vim  myfile  +100                             //打开的同时光标停在第100行行首
	    也可以在打开文件的同时找到第一个匹配的词。
	    vim filename  +/pattern 
	eg:    vim config.mk  +/export             //打开的同时光标停在第一个export所在的位置(词首)


ctags -R


%                             本命令查找与光标所在处相匹配的反括号, 包括 () [] {}
*(#)                        当光标停留在某个单词上时, 输入这条命令表示查找与该单词匹配的下(上)一个单词. 同样, 再输入 n 查找下一个匹配处, 输入 N 反方向查找.




